# Periodic Web Scraping of 'Aktuelle Pegelstände für Emscher und Lippe'

Website from which we will scrape the data is: https://howis.eglv.de/pegel/html/uebersicht_internet.php

![Aktuelle Pegelstände für Emscher und Lippe](foto_website.jpeg)

In [2]:
#importing pandas library
import pandas as pd

In [14]:
#create an empty dataframe
df = pd.DataFrame()

In [15]:
df

Empty DataFrame
Columns: []
Index: []

I will scrape the data every 300 seconds(5 minutes) and save the info into df dataframe

In [16]:
import requests
#imports the 'requests' library, which allows sending HTTP requests and receiving responses
from bs4 import BeautifulSoup
#Imports the 'BeautifulSoup' library, which is a parser for HTML and XML documents
import pandas as pd
import time
#Imports the 'time' module, which provides various time-related functions

while True:
    url = 'https://howis.eglv.de/pegel/html/uebersicht_internet.php'
    #Defines the URL of the website to be scraped
    response = requests.get(url)
    #Sends a GET request to the URL and receives the response

    soup = BeautifulSoup(response.content, 'html.parser')
    #Parses the HTML content of the response using BeautifulSoup and stores it in the variable 'soup'

    tooltips = soup.find_all('div', {'class': 'tooltip'})
    #Extracts all the div tags with the class 'tooltip' from the parsed HTML content and stores them in the variable 'tooltips'

    #A for loop that iterates over each tooltip in 'tooltips' and extracts the relevant information from it. 
    #It extracts the location, water level, discharge, date, and time, and appends them to the list 'tooltip_info'
    tooltip_info = []

    for tooltip in tooltips:
        location = tooltip.find('div', {'class': 'tooltip-head'}).text.strip()
        values = tooltip.find('div', {'class': 'tooltip-body'}).find_all('td', {'class': 'tooltip-value'})
        dates = tooltip.find('div', {'class': 'tooltip-body'}).find_all('td', {'class': 'tooltip-date'})

        if len(values) >= 1:
            width = values[0].text.strip()
        else:
            width = None

        if len(values) >= 2:
            flow = values[1].text.strip()
        else:
            flow = None

        date = None
        time_ = None
        if len(dates) >= 1:
            date = dates[0].text.strip()
        if len(dates) >= 2:
            time_ = dates[1].text.strip()

        tooltip_info.append({'location': location, 'Water_level': width, 'Discharge': flow, 'date': date, 'time': time_})

    new_df = pd.DataFrame(tooltip_info)
    #Creates a new Pandas dataframe from the list 'tooltip_info' and stores it in the variable 'new_df'

    df = pd.concat([df, new_df], ignore_index=True)
    #Concatenates the new dataframe 'new_df' with the existing dataframe 'df', and updates 'df' with the concatenated result.
    
    time.sleep(300)
    #Pauses the loop for 300 seconds (5 minutes) before starting the next iteration

KeyboardInterrupt:

I have scraped data for different periods of time and saved all the information in a csv file using "df.to_csv('data')" command. At the end I have joined all the files together by reading the csv files into a dataframe and than concatenate them all using "pd.concat" command form pandas.

In [21]:
df
#here we check the dataframe

,location,Water_level,Discharge,date,time
0,20001 Fusternberg,323,-,30.03.2023,11:30
1,20004 Dorsten,578,69.3,30.03.2023,11:40
2,28085 Haltern,268,-,30.03.2023,11:40
3,20008 Lünen,299,-,30.03.2023,11:30
4,20012 KA Hamm,342,34.6,30.03.2023,11:30
5,"10026 Mengede, A45",138,-,30.03.2023,11:30
6,10008 Bottrop-Süd,121,-,30.03.2023,11:40
7,"10101 Bottrop, Essener Straße",153,-,30.03.2023,11:40
8,"10119 Gelsenkirchen, Adenauerallee",79,-,30.03.2023,11:40
9,"10099 Dinslaken, Konrad-Adenauer-Straße",209,13.5,30.03.2023,11:40
10,10103 Bahnstraße,218,–,30.03.2023,11:40
11,"10124 Recklinghausen, Am Stadthafen",86,-,30.03.2023,11:40

In [6]:
#df.to_csv('data1.csv', index=False)

I have saved all the information in total_data.csv file.

In [3]:
df = pd.read_csv('all_data.csv')

In [4]:
df

,location,Water_level,Discharge,date,time
0,20001 Fusternberg,274.0,-,06.03.2023,23:30
1,20004 Dorsten,499.0,31,06.03.2023,23:35
2,28085 Haltern,178.0,-,06.03.2023,23:40
3,20008 Lünen,255.0,-,06.03.2023,23:30
4,20012 KA Hamm,338.0,15.5,06.03.2023,23:30
...,...,...,...,...,...
234031,"10101 Bottrop, Essener Straße",159.0,-,28.03.2023,18:30
234032,"10119 Gelsenkirchen, Adenauerallee",81.0,-,28.03.2023,18:30
234033,"10099 Dinslaken, Konrad-Adenauer-Straße",225.0,15.9,28.03.2023,18:35
234034,10103 Bahnstraße,231.0,–,28.03.2023,18:35
234035,"10124 Recklinghausen, Am Stadthafen",92.0,-,28.03.2023,18:30

Now I clean the dataframe from duplicate values

In [5]:
duplicates = df.duplicated()
df1 = df.drop_duplicates()

In [6]:
df1

,location,Water_level,Discharge,date,time
0,20001 Fusternberg,274.0,-,06.03.2023,23:30
1,20004 Dorsten,499.0,31,06.03.2023,23:35
2,28085 Haltern,178.0,-,06.03.2023,23:40
3,20008 Lünen,255.0,-,06.03.2023,23:30
4,20012 KA Hamm,338.0,15.5,06.03.2023,23:30
...,...,...,...,...,...
234031,"10101 Bottrop, Essener Straße",159.0,-,28.03.2023,18:30
234032,"10119 Gelsenkirchen, Adenauerallee",81.0,-,28.03.2023,18:30
234033,"10099 Dinslaken, Konrad-Adenauer-Straße",225.0,15.9,28.03.2023,18:35
234034,10103 Bahnstraße,231.0,–,28.03.2023,18:35
234035,"10124 Recklinghausen, Am Stadthafen",92.0,-,28.03.2023,18:30

In [7]:
df1_hamm = df1[df1['location'] == '20012 KA Hamm']

In [8]:
df1_hamm

             location  Water_level Discharge        date   time
4       20012 KA Hamm        338.0      15.5  06.03.2023  23:30
16      20012 KA Hamm        338.0      15.3  06.03.2023  23:45
40      20012 KA Hamm        338.0      15.6  06.03.2023  23:45
52      20012 KA Hamm        338.0      15.6  07.03.2023  00:00
64      20012 KA Hamm        338.0      15.5  07.03.2023  00:00
...               ...          ...       ...         ...    ...
233956  20012 KA Hamm        342.0      39.2  28.03.2023  18:00
233980  20012 KA Hamm        342.0      40.1  28.03.2023  18:00
233992  20012 KA Hamm        342.0        40  28.03.2023  18:15
234004  20012 KA Hamm        342.0      40.3  28.03.2023  18:15
234028  20012 KA Hamm        342.0      39.5  28.03.2023  18:30

[1432 rows x 5 columns]

In [9]:
df1.location.unique()

array(['20001 Fusternberg', '20004 Dorsten', '28085 Haltern',
       '20008 Lünen', '20012 KA Hamm', '10026 Mengede, A45',
       '10008 Bottrop-Süd', '10101 Bottrop, Essener Straße',
       '10119 Gelsenkirchen, Adenauerallee',
       '10099 Dinslaken, Konrad-Adenauer-Straße', '10103 Bahnstraße',
       '10124 Recklinghausen, Am Stadthafen'], dtype=object)

I need to create a SID (station ID value) unique for every station and also a new column: timestamp where I will join date and time column in datetime format.

In [10]:
#create a copy of df1 DataFrame
df_copy = df1.copy()

#create a new column 'SID' that groups data based on 'location' column and 
#assigns unique integer values to each group
df_copy['SID'] = df_copy.groupby('location').ngroup() + 1

#combine 'date' and 'time' columns to create a new 'timestamp' column
df_copy['timestamp'] = df_copy['date'] + ' ' + df_copy['time']

#convert 'timestamp' column to datetime format using the given format string
df_copy['timestamp'] = pd.to_datetime(df_copy['timestamp'], format='%d.%m.%Y %H:%M')
 
#return the modified DataFrame   
df_copy

,location,Water_level,Discharge,date,time,SID,timestamp
0,20001 Fusternberg,274.0,-,06.03.2023,23:30,8,2023-03-06 23:30:00
1,20004 Dorsten,499.0,31,06.03.2023,23:35,9,2023-03-06 23:35:00
2,28085 Haltern,178.0,-,06.03.2023,23:40,12,2023-03-06 23:40:00
3,20008 Lünen,255.0,-,06.03.2023,23:30,10,2023-03-06 23:30:00
4,20012 KA Hamm,338.0,15.5,06.03.2023,23:30,11,2023-03-06 23:30:00
...,...,...,...,...,...,...,...
234031,"10101 Bottrop, Essener Straße",159.0,-,28.03.2023,18:30,4,2023-03-28 18:30:00
234032,"10119 Gelsenkirchen, Adenauerallee",81.0,-,28.03.2023,18:30,6,2023-03-28 18:30:00
234033,"10099 Dinslaken, Konrad-Adenauer-Straße",225.0,15.9,28.03.2023,18:35,3,2023-03-28 18:35:00
234034,10103 Bahnstraße,231.0,–,28.03.2023,18:35,5,2023-03-28 18:35:00
234035,"10124 Recklinghausen, Am Stadthafen",92.0,-,28.03.2023,18:30,7,2023-03-28 18:30:00

In [11]:
#sort values based in timestamp column
df_copy = df_copy.sort_values(by='timestamp')
df_copy

,location,Water_level,Discharge,date,time,SID,timestamp
0,20001 Fusternberg,274.0,-,06.03.2023,23:30,8,2023-03-06 23:30:00
3,20008 Lünen,255.0,-,06.03.2023,23:30,10,2023-03-06 23:30:00
4,20012 KA Hamm,338.0,15.5,06.03.2023,23:30,11,2023-03-06 23:30:00
5,"10026 Mengede, A45",128.0,-,06.03.2023,23:30,2,2023-03-06 23:30:00
1,20004 Dorsten,499.0,31,06.03.2023,23:35,9,2023-03-06 23:35:00
...,...,...,...,...,...,...,...
464,"10119 Gelsenkirchen, Adenauerallee",NaN,-,NaN,NaN,6,NaT
508,20012 KA Hamm,NaN,-,NaN,NaN,11,NaT
553,20004 Dorsten,NaN,56,NaN,NaN,9,NaT
556,20012 KA Hamm,NaN,29.8,NaN,NaN,11,NaT
89217,"10099 Dinslaken, Konrad-Adenauer-Straße",NaN,-,NaN,NaN,3,NaT

In [12]:
#create a new DataFrame 'new_df1' by dropping rows with missing values 
#in the 'date' column from the 'df_copy' DataFrame
new_df1 = df_copy.dropna(subset=['date'])
new_df1

,location,Water_level,Discharge,date,time,SID,timestamp
0,20001 Fusternberg,274.0,-,06.03.2023,23:30,8,2023-03-06 23:30:00
3,20008 Lünen,255.0,-,06.03.2023,23:30,10,2023-03-06 23:30:00
4,20012 KA Hamm,338.0,15.5,06.03.2023,23:30,11,2023-03-06 23:30:00
5,"10026 Mengede, A45",128.0,-,06.03.2023,23:30,2,2023-03-06 23:30:00
1,20004 Dorsten,499.0,31,06.03.2023,23:35,9,2023-03-06 23:35:00
...,...,...,...,...,...,...,...
234031,"10101 Bottrop, Essener Straße",159.0,-,28.03.2023,18:30,4,2023-03-28 18:30:00
234032,"10119 Gelsenkirchen, Adenauerallee",81.0,-,28.03.2023,18:30,6,2023-03-28 18:30:00
234035,"10124 Recklinghausen, Am Stadthafen",92.0,-,28.03.2023,18:30,7,2023-03-28 18:30:00
234034,10103 Bahnstraße,231.0,–,28.03.2023,18:35,5,2023-03-28 18:35:00
234033,"10099 Dinslaken, Konrad-Adenauer-Straße",225.0,15.9,28.03.2023,18:35,3,2023-03-28 18:35:00

In [13]:
#create a new DataFrame 'new_df2' that contains only the 'timestamp', 'SID', and 'Water_level' 
#columns from the 'new_df1' DataFrame
new_df2 = new_df1[['timestamp', 'SID', 'Water_level']].copy()

#add a new column named 'VAL' and assign 'cm' as its value for all rows
new_df2['VAL'] = 'cm'

#rename the 'Water_level' column to 'PARAM' which stands for PARAMETER
new_df2.rename(columns={'Water_level': 'PARAM'}, inplace=True)

new_df2

                 timestamp  SID  PARAM VAL
0      2023-03-06 23:30:00    8  274.0  cm
3      2023-03-06 23:30:00   10  255.0  cm
4      2023-03-06 23:30:00   11  338.0  cm
5      2023-03-06 23:30:00    2  128.0  cm
1      2023-03-06 23:35:00    9  499.0  cm
...                    ...  ...    ...  ..
234031 2023-03-28 18:30:00    4  159.0  cm
234032 2023-03-28 18:30:00    6   81.0  cm
234035 2023-03-28 18:30:00    7   92.0  cm
234034 2023-03-28 18:35:00    5  231.0  cm
234033 2023-03-28 18:35:00    3  225.0  cm

[14026 rows x 4 columns]

In [14]:
#do the same thing as above but this time for Discharge with unit m3/s
new_df3 = new_df1[['timestamp', 'SID', 'Discharge']].copy()
new_df3['VAL'] = 'm3/s'
new_df3.rename(columns={'Discharge': 'PARAM'}, inplace=True)
new_df3

                 timestamp  SID PARAM   VAL
0      2023-03-06 23:30:00    8     -  m3/s
3      2023-03-06 23:30:00   10     -  m3/s
4      2023-03-06 23:30:00   11  15.5  m3/s
5      2023-03-06 23:30:00    2     -  m3/s
1      2023-03-06 23:35:00    9    31  m3/s
...                    ...  ...   ...   ...
234031 2023-03-28 18:30:00    4     -  m3/s
234032 2023-03-28 18:30:00    6     -  m3/s
234035 2023-03-28 18:30:00    7     -  m3/s
234034 2023-03-28 18:35:00    5     –  m3/s
234033 2023-03-28 18:35:00    3  15.9  m3/s

[14026 rows x 4 columns]

In [15]:
import numpy as np

#replace all occurrences of '–' and '-' in the 'PARAM' column of the 'new_df3' DataFrame with NaN values
new_df3['PARAM'].replace('–', np.nan, inplace=True)
new_df3['PARAM'].replace('-', np.nan, inplace=True)

#drop rows with missing values in the 'PARAM' column from the 'new_df3' DataFrame 
#and create a new DataFrame 'new_df3'
new_df3 = new_df3.dropna(subset=['PARAM'])
new_df3

                 timestamp  SID PARAM   VAL
4      2023-03-06 23:30:00   11  15.5  m3/s
1      2023-03-06 23:35:00    9    31  m3/s
13     2023-03-06 23:40:00    9  30.6  m3/s
9      2023-03-06 23:40:00    3  11.9  m3/s
21     2023-03-06 23:45:00    3    12  m3/s
...                    ...  ...   ...   ...
234021 2023-03-28 18:25:00    3  15.9  m3/s
234013 2023-03-28 18:25:00    9  88.9  m3/s
234025 2023-03-28 18:30:00    9  88.6  m3/s
234028 2023-03-28 18:30:00   11  39.5  m3/s
234033 2023-03-28 18:35:00    3  15.9  m3/s

[5000 rows x 4 columns]

In [16]:
new_df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 4 to 234033
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   timestamp  5000 non-null   datetime64[ns]
 1   SID        5000 non-null   int64
 2   PARAM      5000 non-null   object
 3   VAL        5000 non-null   object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 195.3+ KB

In [17]:
#convert the 'PARAM' column of the 'new_df3' DataFrame from object to float data type
new_df3['PARAM'] = new_df3['PARAM'].astype(float)

/tmp/ipykernel_554368/194913356.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df3['PARAM'] = new_df3['PARAM'].astype(float)

In [18]:
new_df3

                 timestamp  SID  PARAM   VAL
4      2023-03-06 23:30:00   11   15.5  m3/s
1      2023-03-06 23:35:00    9   31.0  m3/s
13     2023-03-06 23:40:00    9   30.6  m3/s
9      2023-03-06 23:40:00    3   11.9  m3/s
21     2023-03-06 23:45:00    3   12.0  m3/s
...                    ...  ...    ...   ...
234021 2023-03-28 18:25:00    3   15.9  m3/s
234013 2023-03-28 18:25:00    9   88.9  m3/s
234025 2023-03-28 18:30:00    9   88.6  m3/s
234028 2023-03-28 18:30:00   11   39.5  m3/s
234033 2023-03-28 18:35:00    3   15.9  m3/s

[5000 rows x 4 columns]

In [19]:
#concatenate the 'timestamp', 'SID', 'PARAM', and 'VAL' columns of the 'new_df2' and 'new_df3' DataFrames 
#along the rows using pd.concat() function and create a new DataFrame 'joined_df'
joined_df = pd.concat([new_df2[['timestamp', 'SID', 'PARAM', 'VAL']], new_df3[['timestamp', 'SID', 'PARAM', 'VAL']]], axis=0)
joined_df

                 timestamp  SID  PARAM   VAL
0      2023-03-06 23:30:00    8  274.0    cm
3      2023-03-06 23:30:00   10  255.0    cm
4      2023-03-06 23:30:00   11  338.0    cm
5      2023-03-06 23:30:00    2  128.0    cm
1      2023-03-06 23:35:00    9  499.0    cm
...                    ...  ...    ...   ...
234021 2023-03-28 18:25:00    3   15.9  m3/s
234013 2023-03-28 18:25:00    9   88.9  m3/s
234025 2023-03-28 18:30:00    9   88.6  m3/s
234028 2023-03-28 18:30:00   11   39.5  m3/s
234033 2023-03-28 18:35:00    3   15.9  m3/s

[19026 rows x 4 columns]

In [20]:
joined_df[joined_df['SID'] == 6]

                 timestamp  SID  PARAM VAL
8      2023-03-06 23:40:00    6   69.0  cm
20     2023-03-06 23:45:00    6   69.0  cm
32     2023-03-06 23:50:00    6   69.0  cm
44     2023-03-06 23:55:00    6   69.0  cm
56     2023-03-07 00:00:00    6   69.0  cm
...                    ...  ...    ...  ..
233984 2023-03-28 18:10:00    6   81.0  cm
233996 2023-03-28 18:15:00    6   81.0  cm
234008 2023-03-28 18:20:00    6   81.0  cm
234020 2023-03-28 18:25:00    6   81.0  cm
234032 2023-03-28 18:30:00    6   81.0  cm

[1577 rows x 4 columns]

Here I use the data which was scraped before in https://howis.eglv.de/pegel/html/stammdaten_html/MO_StammdatenPegel.php?PIDVal=32 website for different PID Values to get the location of stations. I save information for all station locaions in location_df dataframe.

In [46]:
#read the CSV file 'pegel_Sammdata1.csv' located at '/home/kiara/Downloads/' and 
#store the contents in a new DataFrame 'location_df'
location_df = pd.read_csv('/home/kiara/Downloads/pegel_Sammdata1.csv', encoding= 'iso-8859-15')

#display the contents of the 'location_df' DataFrame
location_df

,Unnamed: 0,Station,Pegelnummer,Gewässer,Flusskilometer_(km),Pegelnullpunkt_(m+NN),Einzugsgebiet_(km²),Rechtswert_(Gauss-Krüger),Hochwert_(Gauss-Krüger),MHW_(cm),MW_(cm),MNW_(cm)
0,1,"Berne, Econova Allee",10104,Berne,1.40,31.48,NaN,2566184.00,5707172.00,NaN,NaN,NaN
1,2,"Berne, Sulterkamp",10105,Berne,2.83,32.91,NaN,2567323.00,5706410.00,NaN,NaN,NaN
2,3,Borbecker Mb. Cathostraße,10106,Mb.,0.65,34.22,NaN,2567540.00,5705975.00,NaN,NaN,NaN
3,4,HRB Borbecker Mb. Ablauf,11038,Mb.,1.79,37.10,NaN,2567629.83,5704851.75,244.0,47.0,37.0
4,5,HRB Borbecker Mb. Becken,12036,Mb.,2.20,37.18,NaN,2567554.00,5704546.00,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
126,164,DORS Brücke Gelsenkirchener Strasse,20123,Schölsbach,1.74,0.00,NaN,2567355.90,5724144.20,NaN,NaN,NaN
127,165,DO Bruecke Hoerder Hafenstrasse,10131,Bach,0.22,0.00,NaN,NaN,NaN,NaN,NaN,NaN
128,166,E-Borbeck,1052,Mb.,0.00,0.00,NaN,NaN,NaN,NaN,NaN,NaN
129,167,E Posener Strasse,10135,Mb.,5.75,0.00,NaN,2566473.50,5701578.30,NaN,NaN,NaN
130,168,HRB Scharnhorst,22100,Körne,0.00,61.29,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
df_copy.location.unique()

array(['20001 Fusternberg', '20008 Lünen', '20012 KA Hamm',
       '10026 Mengede, A45', '20004 Dorsten',
       '10124 Recklinghausen, Am Stadthafen', '10103 Bahnstraße',
       '10099 Dinslaken, Konrad-Adenauer-Straße',
       '10101 Bottrop, Essener Straße', '10008 Bottrop-Süd',
       '28085 Haltern', '10119 Gelsenkirchen, Adenauerallee'],
      dtype=object)

In [24]:
#location_df.Station.unique()

In [25]:
#create a new column 'location_num' in the 'new_df1' DataFrame that contains 
#the first word of the 'location' column
new_df1['location_num'] = new_df1['location'].str.split().str[0]
new_df1

/tmp/ipykernel_554368/1934345322.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df1['location_num'] = new_df1['location'].str.split().str[0]

,location,Water_level,Discharge,date,time,SID,timestamp,location_num
0,20001 Fusternberg,274.0,-,06.03.2023,23:30,8,2023-03-06 23:30:00,20001
3,20008 Lünen,255.0,-,06.03.2023,23:30,10,2023-03-06 23:30:00,20008
4,20012 KA Hamm,338.0,15.5,06.03.2023,23:30,11,2023-03-06 23:30:00,20012
5,"10026 Mengede, A45",128.0,-,06.03.2023,23:30,2,2023-03-06 23:30:00,10026
1,20004 Dorsten,499.0,31,06.03.2023,23:35,9,2023-03-06 23:35:00,20004
...,...,...,...,...,...,...,...,...
234031,"10101 Bottrop, Essener Straße",159.0,-,28.03.2023,18:30,4,2023-03-28 18:30:00,10101
234032,"10119 Gelsenkirchen, Adenauerallee",81.0,-,28.03.2023,18:30,6,2023-03-28 18:30:00,10119
234035,"10124 Recklinghausen, Am Stadthafen",92.0,-,28.03.2023,18:30,7,2023-03-28 18:30:00,10124
234034,10103 Bahnstraße,231.0,–,28.03.2023,18:35,5,2023-03-28 18:35:00,10103
234033,"10099 Dinslaken, Konrad-Adenauer-Straße",225.0,15.9,28.03.2023,18:35,3,2023-03-28 18:35:00,10099

In [26]:
#create a new DataFrame 'new_df_copy' that contains only the 'SID', 'location', and 'location_num' columns 
#of the 'new_df1' DataFrame and remove any duplicate rows based on these columns
new_df_copy = new_df1.loc[:, ['SID', 'location', 'location_num']].drop_duplicates()
new_df_copy

    SID                                 location location_num
0     8                        20001 Fusternberg        20001
3    10                              20008 Lünen        20008
4    11                            20012 KA Hamm        20012
5     2                       10026 Mengede, A45        10026
1     9                            20004 Dorsten        20004
11    7      10124 Recklinghausen, Am Stadthafen        10124
10    5                         10103 Bahnstraße        10103
9     3  10099 Dinslaken, Konrad-Adenauer-Straße        10099
7     4            10101 Bottrop, Essener Straße        10101
6     1                        10008 Bottrop-Süd        10008
2    12                            28085 Haltern        28085
8     6       10119 Gelsenkirchen, Adenauerallee        10119

In [27]:
# assuming that the 'location_num' column in new_df_copy matches the 'Pegelnummer' column in location_df
#convert the 'location_num' column of the 'new_df_copy' DataFrame from object to integer data type
new_df_copy['location_num'] = new_df_copy['location_num'].astype(int)

#merge the 'new_df_copy' DataFrame with the 'location_df' DataFrame using 'location_num' column from 'new_df_copy' and 'Pegelnummer' column from 'location_df'
#select only the 'Pegelnummer', 'Rechtswert_(Gauss-Krüger)', and 'Hochwert_(Gauss-Krüger)' columns from the 'location_df' DataFrame
#perform a left join to keep all the rows from 'new_df_copy' DataFrame and add matching columns from 'location_df' DataFrame
#create a new DataFrame 'merged_df' containing the merged result
merged_df = new_df_copy.merge(location_df[['Pegelnummer', 'Rechtswert_(Gauss-Krüger)', 'Hochwert_(Gauss-Krüger)']], left_on='location_num', right_on='Pegelnummer', how='left')
merged_df

,SID,location,location_num,Pegelnummer,Rechtswert_(Gauss-Krüger),Hochwert_(Gauss-Krüger)
0,8,20001 Fusternberg,20001,20001,2544524.00,5724372.00
1,10,20008 Lünen,20008,20008,2597686.00,5721160.00
2,11,20012 KA Hamm,20012,20012,2622828.00,5728949.00
3,2,"10026 Mengede, A45",10026,10026,2594720.00,5716740.00
4,9,20004 Dorsten,20004,20004,2566750.00,5726479.00
5,7,"10124 Recklinghausen, Am Stadthafen",10124,10124,2583904.00,5714716.00
6,5,10103 Bahnstraße,10103,10103,2555146.00,5710660.00
7,3,"10099 Dinslaken, Konrad-Adenauer-Straße",10099,10099,2550008.45,5713883.33
8,4,"10101 Bottrop, Essener Straße",10101,10101,2565049.27,5708062.06
9,1,10008 Bottrop-Süd,10008,10008,2565824.00,5708623.00
10,12,28085 Haltern,28085,28085,2582020.00,5733650.00
11,6,"10119 Gelsenkirchen, Adenauerallee",10119,10119,NaN,NaN

From the resuling dataframe we can see thatthere is no data for station with Pegelnummer = 10119, therefore I check this staion in location_df dataframe

In [28]:
#create a subset of the 'location_df' DataFrame that contains only the rows where the 'Pegelnummer' column equals 10119
location_df[location_df['Pegelnummer'] == 10119]

,Unnamed: 0,Station,Pegelnummer,Gewässer,Flusskilometer_(km),Pegelnullpunkt_(m+NN),Einzugsgebiet_(km²),Rechtswert_(Gauss-Krüger),Hochwert_(Gauss-Krüger),MHW_(cm),MW_(cm),MNW_(cm)
109,146,"Gelsenkirchen, Adenauerallee",10119,Emscher,32.28,30.75,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
# Set the coordinates to (2571918.768, 5710313.487) for location_num = 10119
merged_df.loc[merged_df['Pegelnummer'] == 10119, ['Rechtswert_(Gauss-Krüger)', 'Hochwert_(Gauss-Krüger)']] = [2571918.768, 5710313.487]
merged_df

,SID,location,location_num,Pegelnummer,Rechtswert_(Gauss-Krüger),Hochwert_(Gauss-Krüger)
0,8,20001 Fusternberg,20001,20001,2544524.000,5724372.000
1,10,20008 Lünen,20008,20008,2597686.000,5721160.000
2,11,20012 KA Hamm,20012,20012,2622828.000,5728949.000
3,2,"10026 Mengede, A45",10026,10026,2594720.000,5716740.000
4,9,20004 Dorsten,20004,20004,2566750.000,5726479.000
5,7,"10124 Recklinghausen, Am Stadthafen",10124,10124,2583904.000,5714716.000
6,5,10103 Bahnstraße,10103,10103,2555146.000,5710660.000
7,3,"10099 Dinslaken, Konrad-Adenauer-Straße",10099,10099,2550008.450,5713883.330
8,4,"10101 Bottrop, Essener Straße",10101,10101,2565049.270,5708062.060
9,1,10008 Bottrop-Süd,10008,10008,2565824.000,5708623.000
10,12,28085 Haltern,28085,28085,2582020.000,5733650.000
11,6,"10119 Gelsenkirchen, Adenauerallee",10119,10119,2571918.768,5710313.487

In [30]:
#drop the 'location_num' column from the 'merged_df' DataFrame along the axis 1 (i.e., columns axis) and return the modified DataFrame

merged_df = merged_df.drop('location_num', axis=1)
merged_df

,SID,location,Pegelnummer,Rechtswert_(Gauss-Krüger),Hochwert_(Gauss-Krüger)
0,8,20001 Fusternberg,20001,2544524.000,5724372.000
1,10,20008 Lünen,20008,2597686.000,5721160.000
2,11,20012 KA Hamm,20012,2622828.000,5728949.000
3,2,"10026 Mengede, A45",10026,2594720.000,5716740.000
4,9,20004 Dorsten,20004,2566750.000,5726479.000
5,7,"10124 Recklinghausen, Am Stadthafen",10124,2583904.000,5714716.000
6,5,10103 Bahnstraße,10103,2555146.000,5710660.000
7,3,"10099 Dinslaken, Konrad-Adenauer-Straße",10099,2550008.450,5713883.330
8,4,"10101 Bottrop, Essener Straße",10101,2565049.270,5708062.060
9,1,10008 Bottrop-Süd,10008,2565824.000,5708623.000
10,12,28085 Haltern,28085,2582020.000,5733650.000
11,6,"10119 Gelsenkirchen, Adenauerallee",10119,2571918.768,5710313.487

In [31]:
#save station's locations in locations.csv
merged_df.to_csv('locations.csv', index=False)

# Connection to the database

In [32]:
!conda env list

# conda environments:
#
base                     /home/kiara/anaconda3
geo                      /home/kiara/anaconda3/envs/geo
geotmp                   /home/kiara/anaconda3/envs/geotmp
geotmp1               *  /home/kiara/anaconda3/envs/geotmp1

In [33]:
import os
#Set the proj_lib_path variable to the path where the proj folder is located in my local machine.
proj_lib_path = "/home/kiara/anaconda3/envs/geotmp1/share/proj"

#Added the proj_lib_path to the PROJ_LIB environment variable using the os.environ dictionary.
os.environ['proj_lib'] = proj_lib_path
proj_lib = os.environ['proj_lib']

#Printed the updated value of the PROJ_LIB environment variable 
print(f"New env var value: \nPROJ_LIB={proj_lib:s}")

New env var value:
PROJ_LIB=/home/kiara/anaconda3/envs/geotmp1/share/proj

In [34]:
#load the sql extension into the current Jupyter Notebook environment 
%load_ext sql
print("Connect")

Connect

In [35]:
#connect to a env_db, PostgreSQL database using env_master username, M123xyz password and host where the database is located
%sql postgresql://env_master:M123xyz@localhost/env_db

'Connected: env_master@env_db'

In [36]:
#query is selecting all columns from the schemata table in the information_schema schema.
%%sql
SELECT * FROM information_schema.schemata

 * postgresql://env_master:***@localhost/env_db
6 rows affected.

[('env_db', 'pg_toast', 'postgres', None, None, None, None),
 ('env_db', 'pg_catalog', 'postgres', None, None, None, None),
 ('env_db', 'public', 'postgres', None, None, None, None),
 ('env_db', 'information_schema', 'postgres', None, None, None, None),
 ('env_db', 'gw', 'env_master', None, None, None, None),
 ('env_db', 'eglv', 'env_master', None, None, None, None)]

In [64]:
#create a new schema in the connected PostgreSQL database named eglv, if it does not already exist. The schema will be owned by the user env_master, as specified by the AUTHORIZATION clause.
%%sql
CREATE SCHEMA IF NOT EXISTS eglv AUTHORIZATION env_master

 * postgresql://env_master:***@localhost/env_db
Done.

[]

In [65]:
#selects all rows and columns from the schemata table in the information_schema schema
%%sql
SELECT * FROM information_schema.schemata;

 * postgresql://env_master:***@localhost/env_db
6 rows affected.

[('env_db', 'pg_toast', 'postgres', None, None, None, None),
 ('env_db', 'pg_catalog', 'postgres', None, None, None, None),
 ('env_db', 'public', 'postgres', None, None, None, None),
 ('env_db', 'information_schema', 'postgres', None, None, None, None),
 ('env_db', 'gw', 'env_master', None, None, None, None),
 ('env_db', 'eglv', 'env_master', None, None, None, None)]

In [37]:
#Imports the sqlalchemy library and creates a connection to a PostgreSQL database using the create_engine function.
#This specifies the use of the PostgreSQL database management system, the env_master user credentials, the localhost server location, and the env_db database name
import sqlalchemy
engine = sqlalchemy.create_engine("postgresql://env_master:M123xyz@localhost/env_db")

In [68]:
#!pip install geopandas

In [38]:
import geopandas as gpd
from shapely.geometry import Point
import pandas as pd
import psycopg2
import pyproj
import geopandas as gpd
from shapely.geometry import Point
from pyproj import CRS

The geometry column of the GeoDataFrame is created using the gpd.points_from_xy function, which generates a Point object for each row in the DataFrame based on the Rechtswert_(Gauss-Krüger) and Hochwert_(Gauss-Krüger) columns of the DataFrame. The crs parameter specifies the coordinate reference system (CRS) of the generated Point objects. In this case, the CRS is set to EPSG:31466.

In [39]:
%%time
gdf = gpd.GeoDataFrame(merged_df, geometry=gpd.points_from_xy(merged_df['Rechtswert_(Gauss-Krüger)'], merged_df['Hochwert_(Gauss-Krüger)']), crs="EPSG:31466")

CPU times: user 3.88 ms, sys: 12.2 ms, total: 16 ms
Wall time: 24.3 ms

In [40]:
gdf.info()

<class 'geopandas.geodataframe.GeoDataFrame'>
Int64Index: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   SID                        12 non-null     int64
 1   location                   12 non-null     object
 2   Pegelnummer                12 non-null     int64
 3   Rechtswert_(Gauss-Krüger)  12 non-null     float64
 4   Hochwert_(Gauss-Krüger)    12 non-null     float64
 5   geometry                   12 non-null     geometry
dtypes: float64(2), geometry(1), int64(2), object(1)
memory usage: 672.0+ bytes

In [43]:
#writing a GeoDataFrame to a PostGIS database using SQLAlchemy's create_engine method to connect to the database.
%%time
gdf.to_postgis(con=engine, name="eglv_locations", schema="eglv", index=True, chunksize=100, if_exists="replace")

CPU times: user 15.1 ms, sys: 0 ns, total: 15.1 ms
Wall time: 23.5 ms

In [44]:
#display the GeoDataFrame
gdf

,SID,location,Pegelnummer,Rechtswert_(Gauss-Krüger),Hochwert_(Gauss-Krüger),geometry
0,8,20001 Fusternberg,20001,2544524.000,5724372.000,POINT (2544524.000 5724372.000)
1,10,20008 Lünen,20008,2597686.000,5721160.000,POINT (2597686.000 5721160.000)
2,11,20012 KA Hamm,20012,2622828.000,5728949.000,POINT (2622828.000 5728949.000)
3,2,"10026 Mengede, A45",10026,2594720.000,5716740.000,POINT (2594720.000 5716740.000)
4,9,20004 Dorsten,20004,2566750.000,5726479.000,POINT (2566750.000 5726479.000)
5,7,"10124 Recklinghausen, Am Stadthafen",10124,2583904.000,5714716.000,POINT (2583904.000 5714716.000)
6,5,10103 Bahnstraße,10103,2555146.000,5710660.000,POINT (2555146.000 5710660.000)
7,3,"10099 Dinslaken, Konrad-Adenauer-Straße",10099,2550008.450,5713883.330,POINT (2550008.450 5713883.330)
8,4,"10101 Bottrop, Essener Straße",10101,2565049.270,5708062.060,POINT (2565049.270 5708062.060)
9,1,10008 Bottrop-Süd,10008,2565824.000,5708623.000,POINT (2565824.000 5708623.000)
10,12,28085 Haltern,28085,2582020.000,5733650.000,POINT (2582020.000 5733650.000)
11,6,"10119 Gelsenkirchen, Adenauerallee",10119,2571918.768,5710313.487,POINT (2571918.768 5710313.487)

In [45]:
#save the data for Water Level and Discharge in the database
%%time
joined_df.to_sql(con=engine, name="eglv_Param", schema="eglv", index=True, chunksize=100, if_exists="replace")

CPU times: user 292 ms, sys: 3.03 ms, total: 295 ms
Wall time: 514 ms

19026